---
kind: method
id: M:Autodesk.Revit.DB.NullParameterValue.#ctor
source: html/efd92af3-3503-b0d7-f4af-4b7133f8f517.htm
---
# Autodesk.Revit.DB.NullParameterValue.#ctor Method

Default constructor

## Syntax (C#)
```csharp
public NullParameterValue()
```